Repository: QualityConsultancyGroup/CmdOption
Catalog: *.tototec.cmdoption/src/main/po/*.po
Languages: de

source: Default command "{0}" is not a known command.
de: Defaultbefehl "{0}" is kein bekannter Befehl.

source: File referenced via {0} does not exist.
de: Datei referenziert durch {0} existiert nicht.

source: File referenced via {0} could not be read.
de: Datei referenziert durch {0} konnte nicht gelesen werden.

source: Missing argument(s): {0}. Option "{1}" requires {2} arguments, but you gave {3}.
de: Fehlende Argumente: {0}. Option "{1}" benötigt {2} Argumente, es wurden aber {3} angegeben.

source: Could not apply parameters {0} to field/method {1}
de: Parameter {0} konnte nicht auf Feld/Methode {1} angewendet werden.

source: Missing arguments: {0} Parameter requires {1} arguments, but you gave {2}.
de: Fehlende Argumente: {0} Parameter benötigt {1} argumente, aber es wurden {2} angegeben.

source: Unsupported option or parameter found: {0}
de: Nicht unterstützten Parameter gefunden: {0}

source: at least {0}
de: mindestens {0}

source: exactly {0}
de: genau {0}

source: between {0} and {1}
de: zwischen {0} und {1}

source: Main parameter "{0}" was given {1} times, but must be given {2} times
de: Hauptparameter "{0}" wurde {1} mal angegeben, er muss aber {2} mal angegeben werden

source: Option "{0}" was given {1} times, but must be given {2} times
de: Option "{0}" wurde {1} mal angegeben, sie muss aber {2} mal angegeben werden

source: When using option "{0}" also option "{1}" must be given.
de: Wenn die Option "{0}" verwendet wird, muss auch Option "{1}" angegeben werden.

source: Options "{0}" and "{1}" cannot be used at the same time.
de: Die Optionen "{0}" und "{1}" können nicht gleichzeitig angegeben werden.

source: Could not create handler: {0}
de: Konnte den Handler ich erzeugen: {0}

source: Duplicate command/option name "{0}" found in: {1}
de: Doppelter Kommando-/Optionsname "{0}" gefunden in: {1}

source: Command found without required name in: {0}
de: Kommando ohne einen benötigten Name gefunden: {0}

source: The option "{0}" has inconsistent min..max count configuration (min={1}, max={2}).
de: Die Option "{0}" hat eine inkonsistente min..max count Konfiguration (min={1}, max={2}).

source: The option "{0}" requires the unknown/missing option "{1}".
de: Die Option "{0}" benötigt die unbekannte/fehlende Option "{1}".

source: Option "{0}" is configured to conflicts with itself.
de: Option "{0}" wurde so konfiguriert, dass sie zu sich selbst in Konflikt steht.

source: The option "{0}" conflicts with a unknown/missing option "{1}".
de: Die Option "{0}" steht in Konflikt zu einer unbekannten/fehlenden Option "{1}".

source: More than one main parameter detected ({0}).
de: Mehr als ein Hauptparameter gefunden ({0}).

source: No suitable handler found for option(s): {0} ({1} argument(s))
de: Es konnte kein Prozessor für die Option(en) "{0}" (mit {1} Argument(en)) gefunden werden.

source: More than one parameter definition found. First definition: {0} Second definition: {1}
de: Mehr als eine Parameterdefinition gefunden. Erste Stelle: {0} Zweite Stelle: {1}

source: Parameter definition must support at least on argument.
de: Parameterdefinition muss mindestens ein Argument enthalten.

source: Usage:
de: Aufruf:

source: program
de: programm

source: [options]
de: [Optionen]

source: [command]
de: [Befehl]

source: [command options]
de: [Befehlsoptionen]

source: [command parameters]
de: [Befehlsparameter]

source: Options:
de: Optionen:

source: Commands:
de: Befehle:

source: Options for command:
de: Optionen für Befehl:

source: Parameter for command:
de: Parameter für Befehl:

source: Could not parse argument "{0}" as boolean parameter.
de: Argument {0} konnte nicht als Wahrheitswert gelesen werden.

source: Could not apply argument "{0}".
de: Parameter {0} konnte nicht angewendet werden.

source: Could not read byte value "{0}".
de: Konnte den Byte-Wert "{0}" nicht lesen.

source: Invalid enum value: "{0}". Supported values: {1}
de: Ungültiger Wert: "{0}". Unterstütze Werte: {1}

source: Could not apply parameters: {0} to field/method {1}
de: Parameter {0} konnte nicht auf Feld/Methode {1} angewendet werden

source: Could not read integer value "{0}".
de: Konnte den Integer-Wert "{0}" nicht lesen.

source: Could not read long value "{0}".
de: Konnte den Long-Wert "{0}" nicht lesen.

source: Could not apply parameters {0} to field {1}
de: Parameter {0} konnte zu Feld {1} zugewiesen werden

source: Could not apply parameters: {0} to field {1}
de: Parameter {0} konnte nicht auf Feld {1} angewendet werden

source: Could not apply parameters: {0} to method {1}
de: Parameter {0} konnte nicht auf Methode {1} angewendet werden

source: Invalid url: "{0}"
de: Ungültige URL: "{0}"
